[{"title": "1922", "description": "A farmer pens a confession admitting to his wife's murder, but her death is just the beginning of a macabre tale. Based on Stephen King's novella.\n"}, {"title": "​Maj Rati ​​Keteki", "description": "A successful writer returns to the town that launched his career, encountering people who spark nostalgic, often painfully illuminating flashbacks.\n"}, {"title": "​Mayurakshi", "description": "When a middle-aged divorcee returns to Kolkata to visit his ailing father, long-buried memories resurface, bringing new discoveries with them.\n"}, {"title": "1 Mile to You", "description": "After escaping the bus accident that killed his girlfriend, a high school student channels his grief into running, with the help of a new coach.\n"}, {"title": "12 ROUND GUN", "description": "Dealing with personal demons and the death of his son, a prizefighter attempts a return to the ring by challenging his rival to a 12-round rematch.\n"}, {"title": "6 Days", "description": "When armed gunmen seize the Iranian Embassy in 1980, a tense six-day standoff ensues while elite British soldiers prepare for a dangerous raid.\n"}, {"title": "A Christmas Prince", "description": "Christmas comes early for an aspiring young journalist when she's sent abroad to get the scoop on a dashing prince who's poised to be king.\n"}, {"title": "A Ghost Story", "description": "Following a fatal car crash, a man's spirit remains stuck in the home he shared with his wife as doors into the past and future begin to open.\n"}, {"title": "A Sort of Family", "description": "An Argentine doctor faces legal and ethical challenges when she travels to the countryside to pick up the infant she has been waiting to adopt.\n"}, {"title": "Aftermath", "description": "After an air traffic controller's mistake results in a tragic accident, a man who lost his wife and daughter seeks answers from the man responsible.\n"}, {"title": "Ajji", "description": "When her small granddaughter is sexually assaulted by a powerful man and no justice is served, a poor, frail old woman plots her violent revenge.\n"}, {"title": "Alaska Is a Drag", "description": "Tormented by bullies, an aspiring drag star working at an Alaskan cannery becomes a skilled fighter and is tapped for competition by a boxing coach.\n"}, {"title": "All About Love", "description": "An inseparable couple struggles to stay together when betrayal threatens to tear their lives apart.\n"}, {"title": "All of You", "description": "Two strangers meet on a dating app and experience instant chemistry, but their relationship unravels as jarring differences catch up to them.\n"}, {"title": "All The Reasons To Forget", "description": "A Brazilian man tries a myriad of ways to get over his breakup with his girlfriend but is surprised to learn it's more difficult than he anticipated.\n"}, {"title": "AllI Wish", "description": "Over a series of birthdays, a happy-go-lucky, commitment-averse fashion designer strives to bring a bit of calm to her chaotic love life.\n"}, {"title": "Amar", "description": "Young Laura and Carlos experience the intensity and fragility of first love, as life realities gradually tarnish their idealized notions of romance.\n"}, {"title": "An Imperfect Murder", "description": "Haunted by a nightmare involving her abusive ex-boyfriend, an actress begins to question her reality and whether the incident took place.\n"}, {"title": "An Ordinary Man", "description": "A war criminal in hiding begins to suspect that the maid, his only confidant and contact with the outside world, may be hiding something herself.\n"}, {"title": "Anarkali of Aarah", "description": "After being sexually harassed by a drunken politician while performing at a public event, a village dancer plots revenge to clear her name.\n"}, {"title": "Anchor and Hope", "description": "Kat and Eva’s happy romance hits a rough patch when Eva decides that she wants a child. Visiting friend Roger could help complete their family.\n"}, {"title": "Angamaly Diaries", "description": "After growing up amidst the gang wars of his hometown, Vincent forms an entrepreneurial squad of his own and ends up on the wrong side of the law.\n"}, {"title": "Ayana", "description": "With his carefree bachelor days behind him, a young entrepreneur’s ambitions for adulthood come with some painful personal and professional decisions.\n"}, {"title": "B.A. Pass 2", "description": "A young woman eager to avoid an arranged marriage moves to Mumbai, where she learns hard truths about show business, life and love.\n"}, {"title": "Baahubali 2: The Conclusion (Hindi Version)", "description": "To avenge his father's death, a young man leads an army into battle against a cruel tyrant in this Hindi conclusion to the historic saga.\n"}, {"title": "Baahubali 2: The Conclusion (Malayalam Version)", "description": "To avenge his father's death, a young man leads an army into battle against a cruel tyrant in this Malayalam conclusion to the historic saga.\n"}, {"title": "Baahubali 2: The Conclusion (Tamil Version)", "description": "To avenge his father's death, a young man leads an army into battle against a cruel tyrant in this Tamil conclusion to the historic saga.\n"}, {"title": "Bad Genius", "description": "A top student gets pulled into a cheating racket with increasingly higher risks and even higher rewards. But she may lose much more than she gains.\n"}, {"title": "Band Aid", "description": "A young married couple tries to save their disintegrating relationship by turning their fights into songs, with the help of an oddball neighbor.\n"}, {"title": "Bareilly Ki Barfi", "description": "When she falls in love with the author of a novel she adores, bohemian Bitti enlists the help of a local printer to find her new object of affection.\n"}, {"title": "Before I Fall", "description": "Forced to continually relive the day she dies in a car crash, a privileged high schooler must unravel the cosmic mystery of her suddenly looping life.\n"}, {"title": "Bhasmasur", "description": "In this heart-wrenching coming-of-age story, a young boy embarks on an arduous trek with his debt-ridden father to sell their beloved family donkey.\n"}, {"title": "Bhouri", "description": "A 23-year-old girl who's married to a man more than twice her age is forced to contend with the predatory nature of a male-dominated society.\n"}, {"title": "Bilu Rakkhosh", "description": "Torn between his demanding corporate career, his passion for music and his turbulent family life, a man struggles to keep his inner demons in check.\n"}, {"title": "Bitch", "description": "Cracking under the demands of children and a philandering, thankless husband, an overworked suburban mother assumes the persona of a ferocious dog.\n"}, {"title": "Black Snow", "description": "An old tragedy and lingering animosity erupt when a man returns to Patagonia to convince his estranged brother to sell the family's isolated property.\n"}, {"title": "Bokeh", "description": "After learning they are the sole survivors of an eerie apocalypse, a young American couple on vacation in Iceland ponder their love and the future.\n"}, {"title": "Bottom of the World", "description": "En route to a fresh start in Los Angeles, young couple Alex and Scarlett stop over in a sleepy Southwestern town that loosens their grip on reality.\n"}, {"title": "Burning Sands", "description": "Promising student Zurich opens his eyes to some hard truths when his fraternity's violent hazing escalates into a disastrous hell night.\n"}, {"title": "Camp Cool Kids", "description": "A young boy attends summer camp, where he overcomes his fears, stands up to bullies and learns important lessons about faith and life.\n"}, {"title": "Can't Help Falling in Love", "description": "Gab is eager to tie the knot with her handsome boyfriend, but there's a problem, and it's a doozy: She's already married to a total stranger.\n"}, {"title": "Candyflip", "description": "On the incandescent shores of Goa, a young man tumbles down a mind-bending – and soon dangerous – series of trips after taking hallucinatory drugs.\n"}, {"title": "Cappuccino", "description": "Richi is a director of commercials whose computer memory drive is accidentally switched with that of Sneha, a woman he soon falls in love with.\n"}, {"title": "Carbon", "description": "On the verge of losing his business, an entrepreneur launches a carbon tax scam that thrusts him into a web of criminals, intrigue and murder.\n"}, {"title": "Celebrity Marriage", "description": "A successful actress with an abusive husband confides in friends who have troubling relationship issues of their own.\n"}, {"title": "Chalay Thay Saath", "description": "Beautiful and adventurous doctor Resham meets a handsome Chinese backpacker named Adam while traveling with friends on a journey of self-discovery.\n"}, {"title": "Chappaquiddick", "description": "Senator Ted Kennedy watches his future unravel in the wake of an infamous car crash as family and allies vie to protect his reputation.\n"}, {"title": "Chasing the Dragon", "description": "In corrupt, British-colonized Hong Kong, a mainland Chinese immigrant rises to the top of the city's drug underworld with the help of a notorious cop.\n"}, {"title": "Chocolate City: Vegas Strip", "description": "The exotic dancers from Chocolate City get back together for a trip to Las Vegas and a chance at $500,000 in prize money.\n"}, {"title": "Christmas in the Heartland", "description": "Two girls realize they're both visiting grandparents they’ve never met and decide to switch places to see how the other half lives.\n"}, {"title": "Christmas Inheritance", "description": "To inherit her father's company, socialite Ellen must first visit his small hometown, where she learns the value of hard work and helping others.\n"}, {"title": "CIA: Comrade in America", "description": "A young man in Kerala has two weeks to stop the woman he loves from a fixed marriage in the U.S., but he doesn't have the papers to get there.\n"}, {"title": "Coin Heist", "description": "When a crisis threatens to destroy their high school, four teens hatch a daring plan to raise $10 million. Step one? Breaking into the U.S. Mint.\n"}, {"title": "Daffedar", "description": "A retired government worker continues to dedicate himself to public service, but his principled ways soon clash with those of his extravagant sons.\n"}, {"title": "Dance Academy: The Comeback", "description": "In this adaptation of the TV series, Tara recovers from injury and pursues a career in the U.S., where she grapples with love and professional rejection.\n"}, {"title": "Dayveon", "description": "Following the shooting death of his older brother, a depressed and aimless 13-year-old boy falls in with a gang in rural Arkansas.\n"}, {"title": "Deidra & Laney Rob a Train", "description": "With their mother in jail and bills piling up, ambitious small-town teens Deidra and Laney plot a series of train robberies to keep themselves afloat.\n"}, {"title": "Desire", "description": "A young woman arrives at her estranged sister's wedding to mend fences but falls prey to lust when she meets the groom.\n"}, {"title": "Dhh", "description": "Convinced only a miracle can save them from failing school exams, a trio of friends seek help from a magician. To their surprise, he gamely complies.\n"}, {"title": "Dushman", "description": "An Indian hotel waiter forms an unlikely bond with a Pakistani colleague when the establishment’s criminal owner threatens to ruin both their lives.\n"}, {"title": "El Camino Christmas", "description": "Stuck in a liquor store during an alleged robbery, a group of strangers shares hidden truths and forms an unexpected bond on Christmas Eve.\n"}, {"title": "El silencio es bienvenido", "description": "As a teen languishes during a spiritless road trip, she learns of the troubles in her parents' marriage as a crisis in her country looms.\n"}, {"title": "Face 2 Face", "description": "Two former friends, who now live far apart, learn about each other's insecurities and secrets over a series of video chats.\n"}, {"title": "Familiye", "description": "An ex-con struggles to take care of his two brothers, a gambling addict and a young man with Down syndrome, after being released from prison.\n"}, {"title": "Fanatyk", "description": "As a son deals with his own struggles, he must calm his father's obsession with fishing before his outlandish behavior ruins the entire family.\n"}, {"title": "First They Killed My Father", "description": "A 5-year-old girl embarks on a harrowing quest for survival amid the sudden rise and terrifying reign of the Khmer Rouge in Cambodia.\n"}, {"title": "Forgotten", "description": "When his abducted brother returns seemingly a different man with no memory of the past 19 days, Jin-seok chases after the truth behind the kidnapping.\n"}, {"title": "From Japan to Egypt", "description": "After his wife relocates to her home country of Japan, an Egyptian man – and father of two rambunctious kids – tries to win her back.\n"}, {"title": "FullMetal Alchemist", "description": "While alchemist Edward Elric searches for a way to restore his brother Al's body, the military government and mysterious monsters are watching closely.\n"}, {"title": "Furthest Witness", "description": "Kyle helps people disappear, but when a crazed killer starts hunting down his latest client, he has to decide what he's willing to do to keep her safe.\n"}, {"title": "İstanbul Kırmızısı", "description": "Upon his return to Istanbul, an expat writer-editor finds himself stranded inside a web of tangled relationships after his filmmaker friend vanishes.\n"}, {"title": "Gabriel and the Mountain", "description": "In a drama based on a true story, Brazilian backpacker Gabriel Buchmann spends his gap year exploring Africa. Why does he die in the Malawi mountains?\n"}, {"title": "Galih dan Ratna", "description": "Sparks fly between the new girl at school and the misfit with a passion for music. Yet the world threatens to put a stop to their innocent love song.\n"}, {"title": "God's Own Country", "description": "In Yorkshire, a withdrawn gay farmer begins a torrid affair with a Romanian migrant worker who shows him the depths of his capacity for affection.\n"}, {"title": "Good Time", "description": "After spearheading an ill-fated bank robbery, a man must get his mentally challenged younger brother out of jail while eluding his own capture.\n"}, {"title": "Gook", "description": "Amidst the looting and chaos of the LA riots, two Korean-American brothers fight to save their struggling shoe store while contemplating their future.\n"}, {"title": "Gurgaon", "description": "When the daughter of a wealthy family returns from college, she gets a frosty welcome from her brother, who has problems – and plans – of his own.\n"}, {"title": "Hakkunde", "description": "A perpetually unemployed graduate desperately leaves his city for a potential opportunity until a roadblock threatens to derail his chance at a career.\n"}, {"title": "Half Girlfriend", "description": "Small-town Madhav falls for big-city Riya and wants her to be his girlfriend. But she views their relationship differently, and suggests a compromise.\n"}, {"title": "Heaven Without People", "description": "From long resentments to deep secrets, an overdue family reunion erupts with drama when the matriarch makes a disturbing discovery.\n"}, {"title": "History of Joy", "description": "The life of a high-flying law student takes a drastic turn when a bout of misfortune changes his status in society for good.\n"}, {"title": "Holy Camp!", "description": "In this musical comedy, two rebellious teen girls who love electronic music have a life-changing brush with the divine at a camp run by nuns.\n"}, {"title": "Hombanna", "description": "In the forests of Karnataka, a farmer and his community face eviction from the land when they get caught in the currents of socio-political change.\n"}, {"title": "Hostiles", "description": "After a long career battling the Cheyenne, a U.S. Army captain is ordered to safely escort the tribe's most influential chief to his Montana homeland.\n"}, {"title": "Hot Sweet Sour", "description": "In love since childhood, a couple separates to pursue different paths but makes a pact to marry each other in five years if they are still single.\n"}, {"title": "I Don't Feel at Home in This World Anymore", "description": "A timid nursing assistant gets a new lease on life when she and a neighborhood loner track down the degenerates who broke into her house.\n"}, {"title": "반드시 잡는다", "description": "After people in his town start turning up dead, a grumpy landlord is visited by a man who recounts an unsolved serial murder case from 30 years ago.\n"}, {"title": "III Smoking Barrels", "description": "In three stories set in Northeast India, a child goes on the run, a young adult falls in with the wrong crowd and a desperate man turns to crime.\n"}, {"title": "In Line", "description": "A convicted murderer gets out of prison and reunites with his wife, who is plotting revenge against him after years of physical and emotional abuse.\n"}, {"title": "In Search of Fellini", "description": "A naive and sheltered young woman embarks on a whimsical adventure across Italy in the hopes of meeting director Federico Fellini.\n"}, {"title": "Incomplete", "description": "A man returns to his childhood hometown, where he meets the happily married woman he once jilted, while his best friend endures a more volatile union.\n"}, {"title": "Indian Horse", "description": "Stripped of his heritage at a residential school, an indigenous student finds refuge on the rink when he discovers a passion for hockey.\n"}, {"title": "Invisible", "description": "After learning she's pregnant, a teen grapples with the consequences while trying to go about her life as if nothing has changed.\n"}, {"title": "Inxeba", "description": "At an initiation ritual for the young men of his Xhosa community, a closeted factory hand meets a Johannesburg teen who discovers his best-kept secret.\n"}, {"title": "Ittefaq", "description": "A homemaker and a writer are prime suspects – and the only witnesses – in a double murder, and it’s up to one detective to uncover the elusive truth.\n"}, {"title": "Jindua", "description": "An Indian man in Canada marries a local citizen to legalize his immigration status. The only problem? His girlfriend isn't thrilled about his new wife.\n"}, {"title": "Kaabil", "description": "The happy life of a young blind couple is shattered when the wife is raped and corrupt police won't help, sending the husband on a quest for revenge.\n"}, {"title": "Kaaliyan", "description": "An aggressive, wayward fisherman abandons his wife and daughters, who grow up to face the consequences of their father's mistakes.\n"}, {"title": "Kalki", "description": "A scientist trying to solve one of the universe's greatest puzzles begins a romance with a much younger colleague that's haunted by a dark secret.\n"}, {"title": "Kanavu Variyam", "description": "Despite doubts from fellow villagers who think he’s crazy, an ambitious dropout commits himself to solving a persistent local electricity crisis.\n"}, {"title": "Kartini: Princess of Java", "description": "A woman of nobility battles patriarchal norms in order to improve educational access for women in early 1900s Indonesian society.\n"}, {"title": "Kaviyude Osyath", "description": "When a late poet leaves behind his property to a young man, the man's brother suspects the poet may have been more than just a family friend.\n"}, {"title": "Kings", "description": "A foster mom and her houseful of kids befriend a bitter neighbor after the Rodney King verdict is handed down in 1992 Los Angeles.\n"}, {"title": "Kiss & Cry", "description": "Faced with a rare form of throat cancer, teen figure skater Carley Allison finds strength in singing for an online audience in this biopic.\n"}, {"title": "Kita Kita", "description": "When a tour guide in Japan goes blind after seeing her fiancé’s infidelity, she befriends a fellow Filipino keen to coax her out of the darkness.\n"}, {"title": "Krystal", "description": "A kid with a heart condition falls for an ex-stripper with a lot of baggage and joins her Alcoholics Anonymous group to catch her attention.\n"}, {"title": "Kuldip Patwal: I Didn't Do It!", "description": "Accused of killing a politician, a local grocer’s fight to prove his innocence reveals his lifelong struggles with injustice leading up to the incident.\n"}, {"title": "Kuppivala", "description": "A young woman talented at traditional dance finds her life changed when her love for a man clashes with the wishes of her father.\n"}, {"title": "Lady Bird", "description": "An intrepid high schooler in Sacramento undergoes the trials of love, family and self-discovery as she dreams of escaping to college on the East Coast.\n"}, {"title": "Listen", "description": "A sound engineer falls for a model but after an unfortunate accident, he fights to save their love by triggering her senses.\n"}, {"title": "Loco Love", "description": "A young man and woman fall in love but are threatened to be torn apart by the tensions between their Latino and Caucasian communities in Arizona.\n"}, {"title": "Love and Shukla", "description": "A sexually inexperienced rickshaw driver struggles to build intimacy with his shy new wife in their tiny, overcrowded quarters.\n"}, {"title": "Love Off the Cuff", "description": "Cherie and Jimmy's relationship is in a rut – until Cherie's estranged father shows up and a woman from Jimmy's past shows up with a hidden agenda.\n"}, {"title": "Lucknow Central", "description": "After being arrested for a crime he didn't commit, an aspiring musician teams up with some of his inmates at Lucknow Central to form a band.\n"}, {"title": "Maacher Jhol", "description": "On his first visit to his home city of Kolkata in 13 years, a Paris-based chef is faced with a cooking challenge that will change his life forever.\n"}, {"title": "Mahi NRI", "description": "A Punjabi man attempts to build a life in London in hopes of impressing his girlfriend’s mother, who insists her daughter marry a man outside of India.\n"}, {"title": "Mala Kahich Problem Nahi", "description": "With their relationship running on autopilot, a discontent husband and wife must confront their issues while on a trip with the extended family.\n"}, {"title": "Mandobasar Galpo", "description": "With the assistance of a psychiatrist, an acclaimed filmmaker struggles to come to terms with a mysterious romantic trauma.\n"}, {"title": "Manje Bistre", "description": "While prepping for a family wedding, a young man falls for his sister’s friend, who has already been promised to someone else.\n"}, {"title": "Mantostaan", "description": "Four stories by writer Sadaat Hasan Manto culminate in a single gruesome drama that's set during the partitioning of the Indian subcontinent.\n"}, {"title": "Mantra", "description": "An Indian business owner struggles to keep his company afloat amid global competition while trying to make up for lost time with his family.\n"}, {"title": "Manusangada", "description": "When caste discrimination prevents a villager from giving his deceased father a rightful burial, he takes his fight for equality to court.\n"}, {"title": "Match", "description": "After living with a criminal father, two brothers on different paths head for a direct collision when an intriguing woman enters both of their lives.\n"}, {"title": "Mater", "description": "A single man in his 30s overwhelmed by his domineering mother meets a lesbian couple willing to go to extreme lengths to have a child.\n"}, {"title": "Meditation Park", "description": "An elderly immigrant matriarch from Hong Kong finally begins to break out of her shell of isolation when she suspects her husband of infidelity.\n"}, {"title": "Meet the In-Laws", "description": "When their respective parents oppose their union, a newly engaged couple learns that the reasons for pushback run deeper than just tribal differences.\n"}, {"title": "Meghnadbodh Rohoshyo", "description": "A professor mysteriously vanishes, leaving behind a host of suspects, a shadowy history and a clue: the anonymous birthday gift of a Bengali classic.\n"}, {"title": "Melle", "description": "After recovering from a tragic experience, a young woman makes a journey to her father's homeland and falls in love with a kind-hearted doctor.\n"}, {"title": "Memoir of a Murderer", "description": "Hiding his own murderous past, a man suffering from Alzheimer's must protect his daughter from her boyfriend, who he suspects is also a serial killer.\n"}, {"title": "Menashe", "description": "A year after his wife's death, a widower faces pressure from his Hasidic community to give up his son for adoption unless he finds a new partner.\n"}, {"title": "Mersal", "description": "A detective arrests a doctor for crimes targeting medical professionals but later finds the real culprit in a tale of revenge, corruption and magic.\n"}, {"title": "Milada", "description": "Politician and human rights campaigner Milada Horáková battles against all odds to defend her beliefs in a Czechoslovakia under Communist rule.\n"}, {"title": "Minnaminugu the FireFly", "description": "A nameless widow juggles multiple jobs to support her daughter’s decision to study abroad, only to discover that she has other plans.\n"}, {"title": "Molly's Game", "description": "Former Olympian Molly Bloom ran a high-stakes poker game for the stars – until her lofty lifestyle nearly sent her to prison.\n"}, {"title": "Mom", "description": "After her stepdaughter is sexually assaulted at a party, a furious mother sets out to destroy the lives of the four perpetrators who walked away free.\n"}, {"title": "Mubarakan", "description": "Chaos ensues after two orphaned twin brothers raised apart team up with their eccentric, unmarried uncle to find a solution to their romantic woes.\n"}, {"title": "Mudbound", "description": "Two Mississippi families – one black, one white – confront the brutal realities of prejudice, farming and friendship in a divided World War II era.\n"}, {"title": "Muramba", "description": "A young man and his parents ponder the reasons behind the recent breakdown of a relationship he was in – and the possibility of reconciliation.\n"}, {"title": "Mustang Island", "description": "After being dumped on New Year's Eve, Bill pursues his ex-girlfriend to an off-season Gulf Coast beach town, but things get complicated along the way.\n"}, {"title": "My Daddy is in Heaven", "description": "After the sudden loss of her husband, a mother has a crisis of faith and struggles to keep her life together for the sake of her daughter and herself.\n"}, {"title": "My Ex & Whys", "description": "Popular blogger Cali is hired for a marketing campaign alongside another viral sensation: her ex-boyfriend Gio, who's intent on winning her back.\n"}, {"title": "My Happy Family", "description": "A middle-aged wife and mother of two shocks her traditional, multigenerational Georgian household when she announces she's going to live by herself.\n"}, {"title": "Newness", "description": "Martin and Gabi try to form a relationship after meeting through a hookup app, but when boredom creeps in, they seek out an unconventional solution.\n"}, {"title": "Nibunan", "description": "With numbers written on a doll as their only clue, three officers of the law track down a psychotic killer, unearthing dark secrets along the way.\n"}, {"title": "No One Will Ever Know", "description": "A mother and young son escape into their own imaginations to ignore the reality of their lives in rural Mexico.\n"}, {"title": "November Criminals", "description": "Dissatisfied with the police’s progress, a teen and his best friend investigate their classmate's murder, treading down a dark path to the uneasy truth.\n"}, {"title": "Okja", "description": "A gentle giant and the girl who raised her are caught in the crossfire between animal activism, corporate greed and scientific ethics.\n"}, {"title": "On Body and Soul", "description": "Two shy and socially awkward co-workers in Budapest form a special bond through a mysterious mystic connection that manifests in a dream.\n"}, {"title": "Orbiter 9", "description": "A woman who's been alone on a spaceship her whole life becomes enamored with an engineer who suddenly enters her life and upends her universe.\n"}, {"title": "Oru Vishsheshapetta Biryani Kissa", "description": "When the village's biryani cook unexpectedly passes, a widow steps up to the plate and takes on new delectable challenges.\n"}, {"title": "OtherLife", "description": "After inventing a drug that induces time-compressed virtual realities, young Ren grapples with partner Sam over how to use their powerful creation.\n"}, {"title": "Our Shining Days", "description": "In a battle of the bands, a percussions student and her musical kindred spirits set out to prove the merits of Chinese folk against the Western canon.\n"}, {"title": "Our Souls at Night", "description": "After widowed neighbors Addie and Louis begin sleeping in bed together platonically to alleviate their loneliness, a real romance begins to blossom.\n"}, {"title": "Paathi", "description": "A face painter for Theyyam rituals who is himself disfigured conceals his guilt over the fact that he performs abortions as a medical practitioner.\n"}, {"title": "Pandigai", "description": "Looking for a way out of his impoverished life, a lowly hotel waiter joins an underground fight club. Then he needs a way out of that.\n"}, {"title": "Pareeth Pandaari", "description": "As the parents of three unmarried daughters, a humble cook and his wife contend with the challenges of matchmaking and social expectations.\n"}, {"title": "Phullu", "description": "Struck by the lack of clean resources for menstruating women in his village, a jobless loafer braves social stigmas to create low-cost sanitary napkins.\n"}, {"title": "Pickpockets", "description": "Aspiring teen thieves learn what it takes to be successful pickpockets on the streets of Bogotá from a master in the arts of trickery and deception.\n"}, {"title": "Pimpal", "description": "As a lonely widower prepares to leave India to live with his children in America, he looks back on past memories and unfinished business.\n"}, {"title": "Pop, Lock 'n Roll\"", "description": "An ambitious hip-hop dancer jeopardizes his rising career when his affections for an ominous producer's wife threatens to stomp out all of his success.\n"}, {"title": "Posesif", "description": "A student diver risks her scholastic future and relationship with her father when she dates a moody transfer student consumed by their romance.\n"}, {"title": "Potato Potahto", "description": "A divorced couple decides to continue sharing a home but their already-delicate cohabiting scheme unravels when they begin dating other people.\n"}, {"title": "Power Paandi", "description": "Retired, restless and constantly butting heads with his son, a former stuntman escapes on a road trip that becomes a journey to find his first love.\n"}, {"title": "Princess Cyd", "description": "A teenager moves to Chicago for the summer and finds a poignant mentor in her aunt and a sweet love interest in a girl who works in the neighborhood.\n"}, {"title": "Raees", "description": "After street smart kid Raees rises to become Gujarat's bootlegging king in the 1980s, he tries to balance his life of crime with helping his people.\n"}, {"title": "Rangoon", "description": "During World War II, daredevil star Miss Julia entertains soldiers at the Indo-Burma border, where she's caught up in a web of love and deceit.\n"}, {"title": "Rangreza", "description": "A high-flying rock star and son of a politician falls for a woman from a qawwal family, leading to a love triangle that may consume everyone involved.\n"}, {"title": "Red Oleanders Raktokarobi", "description": "When a theater group stages a production of a Rabindranath Tagore play, they begin to notice parallels between the story and their own lives.\n"}, {"title": "Rememory", "description": "A psychologist is murdered after unveiling a breakthrough invention that extracts memories, spurring a fixated former patient to hunt for answers.\n"}, {"title": "Retablo", "description": "High in the Andes, a teenage boy and his father work together as artisans. But their bond is shattered when the son learns of his father's secret life.\n"}, {"title": "Rip Tide", "description": "Following an embarrassing viral video, a New York model decides to escape from her suffocating existence by visiting her faraway aunt in Australia.\n"}, {"title": "Rodney King", "description": "Roger Guenveur Smith gives voice to the man at the center of the brutal police beating that helped fuel the 1992 LA riots. Spike Lee directs.\n"}, {"title": "Rukh", "description": "Following the untimely death of his father, a young man begins to reconnect with his family while uncovering some difficult truths.\n"}, {"title": "Samantaral", "description": "On a family visit, a young man and his girlfriend set out to discover why his eccentric uncle has been mysteriously confined to one room for years.\n"}, {"title": "Samarppanam", "description": "When a young girl is killed in a suspicious train accident, three very different lives become intertwined in their quest for answers.\n"}, {"title": "Same Kind of Different as Me", "description": "A wealthy couple whose marriage is on the rocks befriends a local homeless man who changes their perspectives in this inspiring true story.\n"}, {"title": "Sand Castle", "description": "After the invasion of Iraq in 2003, a reluctant soldier's platoon is dispatched on a dangerous mission to repair a hostile village's water system.\n"}, {"title": "Sarvopari Palakkaran", "description": "In the course of a human trafficking investigation, a conservative cop crosses paths with an artist-activist in a clash of worldviews.\n"}, {"title": "Sat Shri Akaal England", "description": "After several failed attempts to obtain a visa, a man desperate to escape Punjab pays a British woman to marry him so he can move to England.\n"}, {"title": "Saturday Church", "description": "A teen struggling with gender identity and family tensions seeks hope and support in New York City's underground LGBTQ ballroom community.\n"}, {"title": "Secret Superstar", "description": "A talented teenage singer-songwriter living amid domestic abuse becomes a YouTube sensation after a video in which she hides her identity goes viral.\n"}, {"title": "Septiembre, un llanto en silencio\"", "description": "After a terrorist attack in Guatemala, a baby is rendered deaf and motherless and her father is left to raise her alone.\n"}, {"title": "Seven Sundays", "description": "A dying father asks his busy and grown children to spend their Sundays with him, forcing his family to confront their issues before it's too late.\n"}, {"title": "Shimmer Lake", "description": "Unfolding in reverse time, this darkly comic crime thriller follows a local sheriff hunting three bank robbery suspects, one of whom is his brother.\n"}, {"title": "Shot Caller", "description": "Trying to go straight, a once-successful businessman fresh out of prison is forced to orchestrate a brazen crime or risk his family.\n"}, {"title": "Shubh Aarambh", "description": "As her own wedding looms on the horizon, a marriage counselor strives to save her future in-laws' crumbling relationship.\n"}, {"title": "Shuddhi", "description": "An American woman on a revenge mission travels to India and befriends two journalists seeking justice for violent crimes against women.\n"}, {"title": "Sicilian Ghost Story", "description": "When officials are slow to investigate a mysterious disappearance, a teen girl searches the dark woods on the outskirts of town for the boy she loves.\n"}, {"title": "Singularity", "description": "Nearly a century after artificial intelligence tried to eradicate people from Earth, two survivors search for a human enclave rumored to still exist.\n"}, {"title": "Skins", "description": "Deformed, disfigured characters must find a way to deal with society shunning their differences in this darkly comic social drama.\n"}, {"title": "Slam", "description": "Teen father-to-be Sam imagines his future as a young parent and finds a surprising mentor while reading about his idol, pro skateboarder Tony Hawk.\n"}, {"title": "Slow Country", "description": "Desperate to leave a life of prostitution, a teenage mother attempts to outsmart her ruthless boss who is determined to keep his prized asset.\n"}, {"title": "Small Crimes", "description": "After serving a six-year prison sentence, an ex-cop tries to rebuild his life in his hometown, but gets caught up in the fallout from his past.\n"}, {"title": "Some Freaks", "description": "A one-eyed boy and plus-sized girl form a deep connection. But following a brief separation, they reunite as different people.\n"}, {"title": "Sparring", "description": "A middle-aged boxer with a mixed record becomes a champion's sparring partner while dreaming of one last chance to end his career with a victory.\n"}, {"title": "Speech & Debate", "description": "Fed up with the hypocrisy of the adults around them, three creative high school misfits revive an old debate club as a way to fight back.\n"}, {"title": "SPF-18", "description": "The arrival of an enigmatic struggling musician in Malibu shakes the ground beneath the feet of a teenage girl and her surfer boyfriend.\n"}, {"title": "Sun Dogs", "description": "Rejected by the Marines but eager to serve his country after 9/11, a simple-minded man performs amateur terrorist surveillance with a young runaway.\n"}, {"title": "Sunday's Illness", "description": "Decades after being abandoned as a young child, Chiara finds her mother and asks her to spend 10 days together in a remote location.\n"}, {"title": "Super Dark Times", "description": "A tragic accident drives a wedge between two teenage boys, threatening a friendship that had seemed firm and unshakeable.\n"}, {"title": "Surga Yang Tak Dirindukan 2", "description": "In this sequel to the award-winning 2015 film, Pras, Arini and Meirose face new challenges that could change the dynamic of their unique love triangle.\n"}, {"title": "Sweet Virginia", "description": "In a remote Alaskan town reeling from a sudden triple murder, a former rodeo champ befriends a lone newcomer with a violent occupation.\n"}, {"title": "Taramani", "description": "A traditional man and an independent woman share a connection, but they must learn to navigate their vastly different experiences and expectations.\n"}, {"title": "Tatu", "description": "Doubting her future as a nun, a woman attempts to have a child, triggering a mystic tribal prophecy that could force her to make a godly sacrifice.\n"}, {"title": "Temporada de Caza", "description": "Animosity gives way to love and forgiveness when an angry teenager reunites with his estranged biological father in the wilds of Patagonia.\n"}, {"title": "The Art of Loving", "description": "During Communist rule, a Polish gynecologist and sexologist defies taboo and fights to publish her groundbreaking book on love and sex.\n"}, {"title": "The Bachelors", "description": "After the death of his wife, a teacher and his son move to a new city, where emotional connections with two women help them begin to heal.\n"}, {"title": "The Ballad of Lefty Brown", "description": "After his longtime partner is assassinated, a slow-footed cowboy sets out to find his killer and uncovers a conspiracy engineered by some powerful men.\n"}, {"title": "The Bittersweet", "description": "As a killer stalks the streets, a troubled young courier suspects that a doctor may be the long-lost sister he hasn't seen since childhood.\n"}, {"title": "The Black Prince", "description": "After being exiled to England as a child, a Punjabi prince struggles to return to his homeland and his Sikh faith in this historical drama.\n"}, {"title": "The Breadwinner", "description": "A courageous 11-year-old Afghan girl disguises herself as a boy and takes on odd jobs to provide for her family when her father is arrested.\n"}, {"title": "The Bridge", "description": "A Yoruba prince and a young lady from a prominent Igbo family face tribal prejudice and parental pressure when they secretly wed.\n"}, {"title": "The Bros", "description": "Reunited in their hometown for their father's funeral, two self-interested brothers meet a peculiar woman who shares a huge secret about their family.\n"}, {"title": "The Cakemaker", "description": "When a German baker travels to Jerusalem in search of his dead male lover’s family, his growing involvement with them may expose his truth.\n"}, {"title": "The Case for Christ", "description": "Bothered by his wife's unyielding belief in Christianity, an investigative reporter sets out to use verifiable facts to poke holes in her faith.\n"}, {"title": "The Cell", "description": "A special operations officer vows to get revenge against the terrorist who killed his friend in a brutal attack.\n"}, {"title": "The Clapper", "description": "A newcomer ekes out a living in LA as a professional audience member on infomercials, but life gets complicated when he's thrust into the spotlight.\n"}, {"title": "The Climb", "description": "A young Senegalese-French man from humble roots sets out to climb Mount Everest to impress the woman he loves – and slowly becomes a media sensation.\n"}, {"title": "The Death of Stalin", "description": "The death of Russian dictator Joseph Stalin throws the Soviet Union into comic chaos as his ambitious but addled ministers maneuver to succeed him.\n"}, {"title": "The Desert Bride", "description": "While traveling across Argentina to a new job, a longtime maid encounters a salesman who opens her eyes to life's beauty and possibilities.\n"}, {"title": "The Disaster Artist", "description": "Aspiring actor Greg moves to Los Angeles with his strange friend Tommy, then agrees to star in his movie. Things start weird and get a lot weirder.\n"}, {"title": "The Discovery", "description": "A scientist whose proof of an afterlife caused a rash of suicides forges ahead with his research, while his disapproving son falls for a troubled woman.\n"}, {"title": "The Florida Project", "description": "A mischievous 6-year-old finds the magic in her own circumstances while living with her troubled mom in a budget motel near Disney World.\n"}, {"title": "The Giant", "description": "In 1843, crippled Martin returns from war to his Basque hometown and finds his brother has grown into a giant, which they turn into a circus act.\n"}, {"title": "The Good Catholic", "description": "A young priest’s faith is tested when he finds himself attracted to a woman he meets at confession and his ideals are shaken to the core.\n"}, {"title": "The Healer", "description": "A handyman who has hit rock bottom agrees to live with his distant uncle, who insists that his ability to fix things extends beyond the repair shop.\n"}, {"title": "The Heyday of the Insensitive Bastards", "description": "An all-star cast brings to life the short stories of author Robert Boswell in this anthology series of vignettes set in modern-day America.\n"}, {"title": "The Keeping Hours", "description": "Years after the death of their only child and subsequent divorce, a couple discovers that their son's ghost continues to inhabit their former home.\n"}, {"title": "The Killing of a Sacred Deer", "description": "A surgeon's carefully curated life edges toward disaster when a troubled teenage boy with mysterious motives begins to impose himself on his family.\n"}, {"title": "The last hour", "description": "In this compelling true story, two Peruvian detectives go undercover to locate and capture the elusive leader of the Shining Path guerrilla army.\n"}, {"title": "The Lost Brother", "description": "While settling the affairs of his murdered mother and brother, a man partners with a local thug in a life insurance scam, putting him on a dark path.\n"}, {"title": "The Lovers", "description": "On the verge of divorce, a middle-aged couple, each involved in a serious affair, rethink their marriage and the meaning of love and fidelity.\n"}, {"title": "The Mayor", "description": "With the presidency in mind, the incumbent mayor of Seoul runs for an unprecedented third term – and will stop at nothing to keep his secrets hidden.\n"}, {"title": "The Meyerowitz Stories (New and Selected)", "description": "Grudges and rivalries abound as three adult siblings converge in New York to contend with their prickly artist father – and his fading legacy.\n"}, {"title": "The Most Hated Woman in America", "description": "This drama follows the controversial life of outspoken atheist Madalyn Murray O'Hair, from her landmark court battles to her infamous abduction.\n"}, {"title": "The Motive", "description": "An aspiring writer with no imagination seeks inspiration for his novel by manipulating the lives of his neighbors so that he can write about them.\n"}, {"title": "The Music of Silence", "description": "Based on the autobiography by tenor Andrea Bocelli, this musical biopic chronicles his life from his bumpy childhood to his meteoric rise to fame.\n"}, {"title": "The Ottoman Lieutenant", "description": "As World War I looms, an American nurse travels to the Ottoman Empire on a medical mission, where she clashes with a dashing lieutenant.\n"}, {"title": "The Pirates of Somalia", "description": "An aspiring journalist travels to Somalia in hopes of making a name for himself by covering dangerous pirates and hijackers.\n"}, {"title": "The Price of Success", "description": "Struggling to balance family ties and a career, a rising comedian of Parisian banlieue roots learns the true price of fame.\n"}, {"title": "The Prison", "description": "A cop-turned-convict discovers a crime syndicate inside a prison lorded over by an inmate crime boss – and joins in on their nightly heists.\n"}, {"title": "The Show", "description": "A disillusioned reality TV host and an idealistic producer are lured by their network into producing a show in which participants kill themselves.\n"}, {"title": "The Tribes of Palos Verdes", "description": "When a move to an exclusive seaside community sends her mother and twin brother into a downward spiral, teenager Medina finds solace in surfing.\n"}, {"title": "The Wishing Tree", "description": "Five children living on the edge of a forest band together to save a magical wishing tree from destruction and find their own paths to happiness.\n"}, {"title": "The Workshop", "description": "In an old shipyard town in France, sociopolitical tensions beset a writing workshop where the instructor notices a student with a dark side.\n"}, {"title": "Theeram", "description": "An auto rickshaw driver harbors a deep affection for a young woman, but his troubled past threatens to stand between them.\n"}, {"title": "Thi Mai", "description": "Along with her two friends, a determined woman travels to Vietnam to bring home the baby her recently deceased daughter had planned to adopt.\n"}, {"title": "Thug Life", "description": "A get-rich-quick scheme goes awry when a group of friends stumbles onto a dangerous conspiracy and wind up getting mistaken for the bad guys.\n"}, {"title": "Thumper", "description": "After moving to a hardscrabble suburban California town, a young woman becomes dangerously entangled with a local drug enterprise.\n"}, {"title": "Tikli and Laxmi Bomb", "description": "Two frustrated sex workers cut out the middlemen from their business affairs and start a cooperative that's run entirely by women.\n"}, {"title": "To the Bone", "description": "Ellen, a 20-year-old with anorexia nervosa, goes on a harrowing, sometimes funny journey of self-discovery at a group home run by an unusual doctor.\n"}, {"title": "Toilet: Ek Prem Katha", "description": "On her first day of marriage, a woman leaves her husband upon learning his home lacks a toilet, sparking a quixotic quest to acquire modern sanitation.\n"}, {"title": "Tramps", "description": "Pulled into a shady briefcase swap for different reasons, young strangers Danny and Ellie spend an eventful night together when the deal goes wrong.\n"}, {"title": "Treasures from the Wreck of the Unbelievable", "description": "This cinematic journey into the waters off East Africa chronicles the story behind artist Damien Hirst's massive exhibition of oceanic treasures.\n"}, {"title": "True to the Game", "description": "When a drug kingpin looking to go legit falls for a Philadelphia college student, it doesn't take long for his dangerous world to bleed into her life.\n"}, {"title": "Uncertain Glory", "description": "When Lluís, a disinterested Spanish soldier, meets Carlana, he falls quickly in love, but soon discovers that Carlana's true passion is power.\n"}, {"title": "Union Leader", "description": "Toxic conditions and a corrupt union leader prompt a chemical plant worker and earnest family man to fight for justice for his fellow laborers.\n"}, {"title": "Urvi", "description": "After getting tricked into working at a brothel, a medical student joins forces with two of her co-workers to fight their unscrupulous exploiters.\n"}, {"title": "Verónica", "description": "A reclusive psychologist agrees to treat a patient – whose therapist is missing – at her remote cabin, where the women test each other's boundaries.\n"}, {"title": "Verses of Love 2", "description": "Now a lecturer in Edinburgh, Fahri tries to begin a new chapter as the love of his life, Aisha, volunteers in the Gaza Strip. Have they moved on?\n"}, {"title": "Viceroy's House", "description": "As viceroy Lord Mountbatten arrives in Delhi to oversee a transfer of power from Britain to India in 1947, war looms between religious factions.\n"}, {"title": "Viswasapoorvam Mansoor", "description": "When a mother and her daughter arrive to stay in his home in Kerala, a young Muslim man becomes torn between love, faith and clashing political views.\n"}, {"title": "Walk Away from Love", "description": "Heartbroken from her last relationship, an attorney is wary of falling in love again. But crossing paths with an ex upends her plans to finally move on.\n"}, {"title": "Walking Out", "description": "A suburban teen goes hunting with his estranged father. When a mishap with a bear occurs, he must his use his survival skills to save them both.\n"}, {"title": "War Machine", "description": "When a proud general is tasked with winning an unpopular war, he takes the challenge head-on, not knowing that hubris may be his own worst enemy.\n"}, {"title": "What a Wonderful Family!", "description": "In a large family living under one roof, a storm brews when the matriarch requests a divorce from her husband on their 50th anniversary.\n"}, {"title": "Withdrawn", "description": "Unable to pay bills and unwilling to change his slacker lifestyle, twentysomething Aaron hatches a defrauding scheme when he finds a lost credit card.\n"}, {"title": "Wives on Strike: The Revolution", "description": "After a woman is severely beaten at home, her strong-willed friends take a stand against their husbands to seek justice for domestic abuse victims.\n"}, {"title": "Woodshock", "description": "Shattered after her mother's death, a woman floats away from reality under the effect of a potent, hallucinatory drug as her life decays into chaos.\n"}, {"title": "You Get Me", "description": " alive.\n"}]